RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_ppi_regs.h
/*
 * AON (RW)
 *
 * 0:  use clk_gate in cmd sequence for whether output clock
 * 1: always enable clock output;
 */
#define PPI_CLKPIN_CFG_AON_MASK (0x2U)
#define PPI_CLKPIN_CFG_AON_SHIFT (1U)
#define PPI_CLKPIN_CFG_AON_SET(x) (((uint32_t)(x) << PPI_CLKPIN_CFG_AON_SHIFT) & PPI_CLKPIN_CFG_AON_MASK)
#define PPI_CLKPIN_CFG_AON_GET(x) (((uint32_t)(x) & PPI_CLKPIN_CFG_AON_MASK) >> PPI_CLKPIN_CFG_AON_SHIFT)

/*
 * EN (RW)
 *
 * set to enable clock logic
 */
#define PPI_CLKPIN_CFG_EN_MASK (0x1U)
#define PPI_CLKPIN_CFG_EN_SHIFT (0U)
#define PPI_CLKPIN_CFG_EN_SET(x) (((uint32_t)(x) << PPI_CLKPIN_CFG_EN_SHIFT) & PPI_CLKPIN_CFG_EN_MASK)
#define PPI_CLKPIN_CFG_EN_GET(x) (((uint32_t)(x) & PPI_CLKPIN_CFG_EN_MASK) >> PPI_CLKPIN_CFG_EN_SHIFT)

/* Bitfield definition for register: TM_CFG */
/*
 * TM_EN (RW)
 *
 * timeout enable.
 * if enabled, then if each AHB transfer time exceed tm_cfg clock cycles, will assert irq
 */
#define PPI_TM_CFG_TM_EN_MASK (0x10000UL)
#define PPI_TM_CFG_TM_EN_SHIFT (16U)
#define PPI_TM_CFG_TM_EN_SET(x) (((uint32_t)(x) << PPI_TM_CFG_TM_EN_SHIFT) & PPI_TM_CFG_TM_EN_MASK)
#define PPI_TM_CFG_TM_EN_GET(x) (((uint32_t)(x) & PPI_TM_CFG_TM_EN_MASK) >> PPI_TM_CFG_TM_EN_SHIFT)

/*
 * TM_CFG (RW)
 *
 * timeout value, max 20us at 200MHz clock
 */
#define PPI_TM_CFG_TM_CFG_MASK (0xFFFU)
#define PPI_TM_CFG_TM_CFG_SHIFT (0U)
#define PPI_TM_CFG_TM_CFG_SET(x) (((uint32_t)(x) << PPI_TM_CFG_TM_CFG_SHIFT) & PPI_TM_CFG_TM_CFG_MASK)
#define PPI_TM_CFG_TM_CFG_GET(x) (((uint32_t)(x) & PPI_TM_CFG_TM_CFG_MASK) >> PPI_TM_CFG_TM_CFG_SHIFT)

/* Bitfield definition for register: IRQ_STS */
/*
 * IRQ_TMOUT_STS (RW1C)
 *
 * tiemout interrupt status, write 1 to clear
 */
#define PPI_IRQ_STS_IRQ_TMOUT_STS_MASK (0x1U)
#define PPI_IRQ_STS_IRQ_TMOUT_STS_SHIFT (0U)
#define PPI_IRQ_STS_IRQ_TMOUT_STS_SET(x) (((uint32_t)(x) << PPI_IRQ_STS_IRQ_TMOUT_STS_SHIFT) & PPI_IRQ_STS_IRQ_TMOUT_STS_MASK)
#define PPI_IRQ_STS_IRQ_TMOUT_STS_GET(x) (((uint32_t)(x) & PPI_IRQ_STS_IRQ_TMOUT_STS_MASK) >> PPI_IRQ_STS_IRQ_TMOUT_STS_SHIFT)

/* Bitfield definition for register: IRQ_EN */
/*
 * IRQ_TMOUT_EN (RW)
 *
 * timeout interrupt enable
 */
#define PPI_IRQ_EN_IRQ_TMOUT_EN_MASK (0x1U)
#define PPI_IRQ_EN_IRQ_TMOUT_EN_SHIFT (0U)
#define PPI_IRQ_EN_IRQ_TMOUT_EN_SET(x) (((uint32_t)(x) << PPI_IRQ_EN_IRQ_TMOUT_EN_SHIFT) & PPI_IRQ_EN_IRQ_TMOUT_EN_MASK)
#define PPI_IRQ_EN_IRQ_TMOUT_EN_GET(x) (((uint32_t)(x) & PPI_IRQ_EN_IRQ_TMOUT_EN_MASK) >> PPI_IRQ_EN_IRQ_TMOUT_EN_SHIFT)

/* Bitfield definition for register of struct array CS: CFG0 */
/*
 * ADDR_END (RW)
 *
 */
#define PPI_CS_CFG0_ADDR_END_MASK (0xFFF0000UL)
#define PPI_CS_CFG0_ADDR_END_SHIFT (16U)
#define PPI_CS_CFG0_ADDR_END_SET(x) (((uint32_t)(x) << PPI_CS_CFG0_ADDR_END_SHIFT) & PPI_CS_CFG0_ADDR_END_MASK)
#define PPI_CS_CFG0_ADDR_END_GET(x) (((uint32_t)(x) & PPI_CS_CFG0_ADDR_END_MASK) >> PPI_CS_CFG0_ADDR_END_SHIFT)

/*
 * ADDR_START (RW)
 *
 * addr_start and addr_end config the address slot for CS0, use high 12bit,
 * the minimun slot is 1Mbyte(addr_start==addr_end)
 */
#define PPI_CS_CFG0_ADDR_START_MASK (0xFFFU)
#define PPI_CS_CFG0_ADDR_START_SHIFT (0U)
#define PPI_CS_CFG0_ADDR_START_SET(x) (((uint32_t)(x) << PPI_CS_CFG0_ADDR_START_SHIFT) & PPI_CS_CFG0_ADDR_START_MASK)
#define PPI_CS_CFG0_ADDR_START_GET(x) (((uint32_t)(x) & PPI_CS_CFG0_ADDR_START_MASK) >> PPI_CS_CFG0_ADDR_START_SHIFT)

/* Bitfield definition for register of struct array CS: CFG1 */
/*
 * ADDR_MASK (RW)
 *
 * the high AHB address will AND with {cs0_mask[15:0], 16'hFFFF},
 * shift right with addr_shift, then output as real address.
 */
#define PPI_CS_CFG1_ADDR_MASK_MASK (0xFFFF0000UL)
#define PPI_CS_CFG1_ADDR_MASK_SHIFT (16U)
#define PPI_CS_CFG1_ADDR_MASK_SET(x) (((uint32_t)(x) << PPI_CS_CFG1_ADDR_MASK_SHIFT) & PPI_CS_CFG1_ADDR_MASK_MASK)
#define PPI_CS_CFG1_ADDR_MASK_GET(x) (((uint32_t)(x) & PPI_CS_CFG1_ADDR_MASK_MASK) >> PPI_CS_CFG1_ADDR_MASK_SHIFT)

/*
 * ADDR_SHIFT (RW)
 *
 * gennerally should be configured according to port size,
 * 0 for 8bit; 1 for 16bit; 2 for 32bit;
 */
#define PPI_CS_CFG1_ADDR_SHIFT_MASK (0xFU)
#define PPI_CS_CFG1_ADDR_SHIFT_SHIFT (0U)
#define PPI_CS_CFG1_ADDR_SHIFT_SET(x) (((uint32_t)(x) << PPI_CS_CFG1_ADDR_SHIFT_SHIFT) & PPI_CS_CFG1_ADDR_SHIFT_MASK)
#define PPI_CS_CFG1_ADDR_SHIFT_GET(x) (((uint32_t)(x) & PPI_CS_CFG1_ADDR_SHIFT_MASK) >> PPI_CS_CFG1_ADDR_SHIFT_SHIFT)

/* Bitfield definition for register of struct array CS: CFG2 */
/*
 * CS_SYNC_EN (RW)
 *
 * set to enable CS pin sync with clock counter.
 * Clr if use async mode(no clk pin), or not care the CS start time with clk pin
 */
#define PPI_CS_CFG2_CS_SYNC_EN_MASK (0x10000000UL)
#define PPI_CS_CFG2_CS_SYNC_EN_SHIFT (28U)
#define PPI_CS_CFG2_CS_SYNC_EN_SET(x) (((uint32_t)(x) << PPI_CS_CFG2_CS_SYNC_EN_SHIFT) & PPI_CS_CFG2_CS_SYNC_EN_MASK)
#define PPI_CS_CFG2_CS_SYNC_EN_GET(x) (((uint32_t)(x) & PPI_CS_CFG2_CS_SYNC_EN_MASK) >> PPI_CS_CFG2_CS_SYNC_EN_SHIFT)

/*
 * SYNC_CLK_SEL (RW)
 *
 * CS assert at when clk_div_cnt equal to sync_clk_sel
 */
#define PPI_CS_CFG2_SYNC_CLK_SEL_MASK (0xF00000UL)
#define PPI_CS_CFG2_SYNC_CLK_SEL_SHIFT (20U)
#define PPI_CS_CFG2_SYNC_CLK_SEL_SET(x) (((uint32_t)(x) << PPI_CS_CFG2_SYNC_CLK_SEL_SHIFT) & PPI_CS_CFG2_SYNC_CLK_SEL_MASK)
#define PPI_CS_CFG2_SYNC_CLK_SEL_GET(x) (((uint32_t)(x) & PPI_CS_CFG2_SYNC_CLK_SEL_MASK) >> PPI_CS_CFG2_SYNC_CLK_SEL_SHIFT)

/*
 * READY_IN_SEL (RW)
 *
 * 0: use two stage sync;
 * 1: use one stage sync
 */
#define PPI_CS_CFG2_READY_IN_SEL_MASK (0x1000U)
#define PPI_CS_CFG2_READY_IN_SEL_SHIFT (12U)
#define PPI_CS_CFG2_READY_IN_SEL_SET(x) (((uint32_t)(x) << PPI_CS_CFG2_READY_IN_SEL_SHIFT) & PPI_CS_CFG2_READY_IN_SEL_MASK)
#define PPI_CS_CFG2_READY_IN_SEL_GET(x) (((uint32_t)(x) & PPI_CS_CFG2_READY_IN_SEL_MASK) >> PPI_CS_CFG2_READY_IN_SEL_SHIFT)

/*
 * INTER_CMD_DLY (RW)
 *
 * set to none-zero value, will add delay between each command sequence for burst cmd,
 * or splited transfer cmd sequence(such as transfer 32bit on 16bit port),
 * CS will be de-assert during the delay.
 */
#define PPI_CS_CFG2_INTER_CMD_DLY_MASK (0xF0U)
#define PPI_CS_CFG2_INTER_CMD_DLY_SHIFT (4U)
#define PPI_CS_CFG2_INTER_CMD_DLY_SET(x) (((uint32_t)(x) << PPI_CS_CFG2_INTER_CMD_DLY_SHIFT) & PPI_CS_CFG2_INTER_CMD_DLY_MASK)
#define PPI_CS_CFG2_INTER_CMD_DLY_GET(x) (((uint32_t)(x) & PPI_CS_CFG2_INTER_CMD_DLY_MASK) >> PPI_CS_CFG2_INTER_CMD_DLY_SHIFT)

