RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_ppi_regs.h
/*
 * PORT_SIZE (RW)
 *
 * 00-8bit; 01-16bit; 10-32bit; 11-reserved
 */
#define PPI_CS_CFG2_PORT_SIZE_MASK (0x6U)
#define PPI_CS_CFG2_PORT_SIZE_SHIFT (1U)
#define PPI_CS_CFG2_PORT_SIZE_SET(x) (((uint32_t)(x) << PPI_CS_CFG2_PORT_SIZE_SHIFT) & PPI_CS_CFG2_PORT_SIZE_MASK)
#define PPI_CS_CFG2_PORT_SIZE_GET(x) (((uint32_t)(x) & PPI_CS_CFG2_PORT_SIZE_MASK) >> PPI_CS_CFG2_PORT_SIZE_SHIFT)

/*
 * ENABLE (RW)
 *
 * CS enable
 */
#define PPI_CS_CFG2_ENABLE_MASK (0x1U)
#define PPI_CS_CFG2_ENABLE_SHIFT (0U)
#define PPI_CS_CFG2_ENABLE_SET(x) (((uint32_t)(x) << PPI_CS_CFG2_ENABLE_SHIFT) & PPI_CS_CFG2_ENABLE_MASK)
#define PPI_CS_CFG2_ENABLE_GET(x) (((uint32_t)(x) & PPI_CS_CFG2_ENABLE_MASK) >> PPI_CS_CFG2_ENABLE_SHIFT)

/* Bitfield definition for register of struct array CS: CFG3 */
/*
 * RCMD_END1 (RW)
 *
 * sequential read cmd end index
 */
#define PPI_CS_CFG3_RCMD_END1_MASK (0x3F000000UL)
#define PPI_CS_CFG3_RCMD_END1_SHIFT (24U)
#define PPI_CS_CFG3_RCMD_END1_SET(x) (((uint32_t)(x) << PPI_CS_CFG3_RCMD_END1_SHIFT) & PPI_CS_CFG3_RCMD_END1_MASK)
#define PPI_CS_CFG3_RCMD_END1_GET(x) (((uint32_t)(x) & PPI_CS_CFG3_RCMD_END1_MASK) >> PPI_CS_CFG3_RCMD_END1_SHIFT)

/*
 * RCMD_START1 (RW)
 *
 * sequential read cmd start index
 */
#define PPI_CS_CFG3_RCMD_START1_MASK (0x3F0000UL)
#define PPI_CS_CFG3_RCMD_START1_SHIFT (16U)
#define PPI_CS_CFG3_RCMD_START1_SET(x) (((uint32_t)(x) << PPI_CS_CFG3_RCMD_START1_SHIFT) & PPI_CS_CFG3_RCMD_START1_MASK)
#define PPI_CS_CFG3_RCMD_START1_GET(x) (((uint32_t)(x) & PPI_CS_CFG3_RCMD_START1_MASK) >> PPI_CS_CFG3_RCMD_START1_SHIFT)

/*
 * RCMD_END0 (RW)
 *
 * first read cmd end index
 */
#define PPI_CS_CFG3_RCMD_END0_MASK (0x3F00U)
#define PPI_CS_CFG3_RCMD_END0_SHIFT (8U)
#define PPI_CS_CFG3_RCMD_END0_SET(x) (((uint32_t)(x) << PPI_CS_CFG3_RCMD_END0_SHIFT) & PPI_CS_CFG3_RCMD_END0_MASK)
#define PPI_CS_CFG3_RCMD_END0_GET(x) (((uint32_t)(x) & PPI_CS_CFG3_RCMD_END0_MASK) >> PPI_CS_CFG3_RCMD_END0_SHIFT)

/*
 * RCMD_START0 (RW)
 *
 * first read cmd start index
 */
#define PPI_CS_CFG3_RCMD_START0_MASK (0x3FU)
#define PPI_CS_CFG3_RCMD_START0_SHIFT (0U)
#define PPI_CS_CFG3_RCMD_START0_SET(x) (((uint32_t)(x) << PPI_CS_CFG3_RCMD_START0_SHIFT) & PPI_CS_CFG3_RCMD_START0_MASK)
#define PPI_CS_CFG3_RCMD_START0_GET(x) (((uint32_t)(x) & PPI_CS_CFG3_RCMD_START0_MASK) >> PPI_CS_CFG3_RCMD_START0_SHIFT)

/* Bitfield definition for register of struct array CS: CFG4 */
/*
 * WCMD_END1 (RW)
 *
 * sequential write cmd end index
 */
#define PPI_CS_CFG4_WCMD_END1_MASK (0x3F000000UL)
#define PPI_CS_CFG4_WCMD_END1_SHIFT (24U)
#define PPI_CS_CFG4_WCMD_END1_SET(x) (((uint32_t)(x) << PPI_CS_CFG4_WCMD_END1_SHIFT) & PPI_CS_CFG4_WCMD_END1_MASK)
#define PPI_CS_CFG4_WCMD_END1_GET(x) (((uint32_t)(x) & PPI_CS_CFG4_WCMD_END1_MASK) >> PPI_CS_CFG4_WCMD_END1_SHIFT)

/*
 * WCMD_START1 (RW)
 *
 * sequential write cmd start index
 */
#define PPI_CS_CFG4_WCMD_START1_MASK (0x3F0000UL)
#define PPI_CS_CFG4_WCMD_START1_SHIFT (16U)
#define PPI_CS_CFG4_WCMD_START1_SET(x) (((uint32_t)(x) << PPI_CS_CFG4_WCMD_START1_SHIFT) & PPI_CS_CFG4_WCMD_START1_MASK)
#define PPI_CS_CFG4_WCMD_START1_GET(x) (((uint32_t)(x) & PPI_CS_CFG4_WCMD_START1_MASK) >> PPI_CS_CFG4_WCMD_START1_SHIFT)

/*
 * WCMD_END0 (RW)
 *
 * first write cmd end index
 */
#define PPI_CS_CFG4_WCMD_END0_MASK (0x3F00U)
#define PPI_CS_CFG4_WCMD_END0_SHIFT (8U)
#define PPI_CS_CFG4_WCMD_END0_SET(x) (((uint32_t)(x) << PPI_CS_CFG4_WCMD_END0_SHIFT) & PPI_CS_CFG4_WCMD_END0_MASK)
#define PPI_CS_CFG4_WCMD_END0_GET(x) (((uint32_t)(x) & PPI_CS_CFG4_WCMD_END0_MASK) >> PPI_CS_CFG4_WCMD_END0_SHIFT)

/*
 * WCMD_START0 (RW)
 *
 * first write cmd start index
 */
#define PPI_CS_CFG4_WCMD_START0_MASK (0x3FU)
#define PPI_CS_CFG4_WCMD_START0_SHIFT (0U)
#define PPI_CS_CFG4_WCMD_START0_SET(x) (((uint32_t)(x) << PPI_CS_CFG4_WCMD_START0_SHIFT) & PPI_CS_CFG4_WCMD_START0_MASK)
#define PPI_CS_CFG4_WCMD_START0_GET(x) (((uint32_t)(x) & PPI_CS_CFG4_WCMD_START0_MASK) >> PPI_CS_CFG4_WCMD_START0_SHIFT)

/* Bitfield definition for register of struct array CMD: CMD_CFG */
/*
 * CS_VAL (RW)
 *
 * cs value in current cmd
 */
#define PPI_CMD_CMD_CFG_CS_VAL_MASK (0x20000UL)
#define PPI_CMD_CMD_CFG_CS_VAL_SHIFT (17U)
#define PPI_CMD_CMD_CFG_CS_VAL_SET(x) (((uint32_t)(x) << PPI_CMD_CMD_CFG_CS_VAL_SHIFT) & PPI_CMD_CMD_CFG_CS_VAL_MASK)
#define PPI_CMD_CMD_CFG_CS_VAL_GET(x) (((uint32_t)(x) & PPI_CMD_CMD_CFG_CS_VAL_MASK) >> PPI_CMD_CMD_CFG_CS_VAL_SHIFT)

/*
 * CLK_GATE (RW)
 *
 * the clock gate enable signal, set to output clock signal
 */
#define PPI_CMD_CMD_CFG_CLK_GATE_MASK (0x10000UL)
#define PPI_CMD_CMD_CFG_CLK_GATE_SHIFT (16U)
#define PPI_CMD_CMD_CFG_CLK_GATE_SET(x) (((uint32_t)(x) << PPI_CMD_CMD_CFG_CLK_GATE_SHIFT) & PPI_CMD_CMD_CFG_CLK_GATE_MASK)
#define PPI_CMD_CMD_CFG_CLK_GATE_GET(x) (((uint32_t)(x) & PPI_CMD_CMD_CFG_CLK_GATE_MASK) >> PPI_CMD_CMD_CFG_CLK_GATE_SHIFT)

/*
 * CYCLE_NUM (RW)
 *
 * cmd clock cycles
 */
#define PPI_CMD_CMD_CFG_CYCLE_NUM_MASK (0xFFU)
#define PPI_CMD_CMD_CFG_CYCLE_NUM_SHIFT (0U)
#define PPI_CMD_CMD_CFG_CYCLE_NUM_SET(x) (((uint32_t)(x) << PPI_CMD_CMD_CFG_CYCLE_NUM_SHIFT) & PPI_CMD_CMD_CFG_CYCLE_NUM_MASK)
#define PPI_CMD_CMD_CFG_CYCLE_NUM_GET(x) (((uint32_t)(x) & PPI_CMD_CMD_CFG_CYCLE_NUM_MASK) >> PPI_CMD_CMD_CFG_CYCLE_NUM_SHIFT)

/* Bitfield definition for register of struct array CMD: AD_CFG */
/*
 * DIR3 (RW)
 *
 */
#define PPI_CMD_AD_CFG_DIR3_MASK (0x8000U)
#define PPI_CMD_AD_CFG_DIR3_SHIFT (15U)
#define PPI_CMD_AD_CFG_DIR3_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_DIR3_SHIFT) & PPI_CMD_AD_CFG_DIR3_MASK)
#define PPI_CMD_AD_CFG_DIR3_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_DIR3_MASK) >> PPI_CMD_AD_CFG_DIR3_SHIFT)

/*
 * AD_SEL3 (RW)
 *
 */
#define PPI_CMD_AD_CFG_AD_SEL3_MASK (0x4000U)
#define PPI_CMD_AD_CFG_AD_SEL3_SHIFT (14U)
#define PPI_CMD_AD_CFG_AD_SEL3_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_AD_SEL3_SHIFT) & PPI_CMD_AD_CFG_AD_SEL3_MASK)
#define PPI_CMD_AD_CFG_AD_SEL3_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_AD_SEL3_MASK) >> PPI_CMD_AD_CFG_AD_SEL3_SHIFT)

/*
 * BYTE_SEL3 (RW)
 *
 */
#define PPI_CMD_AD_CFG_BYTE_SEL3_MASK (0x3000U)
#define PPI_CMD_AD_CFG_BYTE_SEL3_SHIFT (12U)
#define PPI_CMD_AD_CFG_BYTE_SEL3_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_BYTE_SEL3_SHIFT) & PPI_CMD_AD_CFG_BYTE_SEL3_MASK)
#define PPI_CMD_AD_CFG_BYTE_SEL3_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_BYTE_SEL3_MASK) >> PPI_CMD_AD_CFG_BYTE_SEL3_SHIFT)

