RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_ppi_regs.h
/*
 * DIR2 (RW)
 *
 */
#define PPI_CMD_AD_CFG_DIR2_MASK (0x800U)
#define PPI_CMD_AD_CFG_DIR2_SHIFT (11U)
#define PPI_CMD_AD_CFG_DIR2_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_DIR2_SHIFT) & PPI_CMD_AD_CFG_DIR2_MASK)
#define PPI_CMD_AD_CFG_DIR2_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_DIR2_MASK) >> PPI_CMD_AD_CFG_DIR2_SHIFT)

/*
 * AD_SEL2 (RW)
 *
 */
#define PPI_CMD_AD_CFG_AD_SEL2_MASK (0x400U)
#define PPI_CMD_AD_CFG_AD_SEL2_SHIFT (10U)
#define PPI_CMD_AD_CFG_AD_SEL2_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_AD_SEL2_SHIFT) & PPI_CMD_AD_CFG_AD_SEL2_MASK)
#define PPI_CMD_AD_CFG_AD_SEL2_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_AD_SEL2_MASK) >> PPI_CMD_AD_CFG_AD_SEL2_SHIFT)

/*
 * BYTE_SEL2 (RW)
 *
 */
#define PPI_CMD_AD_CFG_BYTE_SEL2_MASK (0x300U)
#define PPI_CMD_AD_CFG_BYTE_SEL2_SHIFT (8U)
#define PPI_CMD_AD_CFG_BYTE_SEL2_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_BYTE_SEL2_SHIFT) & PPI_CMD_AD_CFG_BYTE_SEL2_MASK)
#define PPI_CMD_AD_CFG_BYTE_SEL2_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_BYTE_SEL2_MASK) >> PPI_CMD_AD_CFG_BYTE_SEL2_SHIFT)

/*
 * DIR1 (RW)
 *
 */
#define PPI_CMD_AD_CFG_DIR1_MASK (0x80U)
#define PPI_CMD_AD_CFG_DIR1_SHIFT (7U)
#define PPI_CMD_AD_CFG_DIR1_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_DIR1_SHIFT) & PPI_CMD_AD_CFG_DIR1_MASK)
#define PPI_CMD_AD_CFG_DIR1_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_DIR1_MASK) >> PPI_CMD_AD_CFG_DIR1_SHIFT)

/*
 * AD_SEL1 (RW)
 *
 */
#define PPI_CMD_AD_CFG_AD_SEL1_MASK (0x40U)
#define PPI_CMD_AD_CFG_AD_SEL1_SHIFT (6U)
#define PPI_CMD_AD_CFG_AD_SEL1_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_AD_SEL1_SHIFT) & PPI_CMD_AD_CFG_AD_SEL1_MASK)
#define PPI_CMD_AD_CFG_AD_SEL1_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_AD_SEL1_MASK) >> PPI_CMD_AD_CFG_AD_SEL1_SHIFT)

/*
 * BYTE_SEL1 (RW)
 *
 */
#define PPI_CMD_AD_CFG_BYTE_SEL1_MASK (0x30U)
#define PPI_CMD_AD_CFG_BYTE_SEL1_SHIFT (4U)
#define PPI_CMD_AD_CFG_BYTE_SEL1_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_BYTE_SEL1_SHIFT) & PPI_CMD_AD_CFG_BYTE_SEL1_MASK)
#define PPI_CMD_AD_CFG_BYTE_SEL1_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_BYTE_SEL1_MASK) >> PPI_CMD_AD_CFG_BYTE_SEL1_SHIFT)

/*
 * DIR0 (RW)
 *
 * 0 for OUT; 1 for IN
 */
#define PPI_CMD_AD_CFG_DIR0_MASK (0x8U)
#define PPI_CMD_AD_CFG_DIR0_SHIFT (3U)
#define PPI_CMD_AD_CFG_DIR0_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_DIR0_SHIFT) & PPI_CMD_AD_CFG_DIR0_MASK)
#define PPI_CMD_AD_CFG_DIR0_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_DIR0_MASK) >> PPI_CMD_AD_CFG_DIR0_SHIFT)

/*
 * AD_SEL0 (RW)
 *
 * 0 for data; 1 for address.
 */
#define PPI_CMD_AD_CFG_AD_SEL0_MASK (0x4U)
#define PPI_CMD_AD_CFG_AD_SEL0_SHIFT (2U)
#define PPI_CMD_AD_CFG_AD_SEL0_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_AD_SEL0_SHIFT) & PPI_CMD_AD_CFG_AD_SEL0_MASK)
#define PPI_CMD_AD_CFG_AD_SEL0_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_AD_SEL0_MASK) >> PPI_CMD_AD_CFG_AD_SEL0_SHIFT)

/*
 * BYTE_SEL0 (RW)
 *
 * select one of the 4 bytes(11 for 31:24,  10 for 23:16, 01 for 15:8, 00 for 7:0)
 */
#define PPI_CMD_AD_CFG_BYTE_SEL0_MASK (0x3U)
#define PPI_CMD_AD_CFG_BYTE_SEL0_SHIFT (0U)
#define PPI_CMD_AD_CFG_BYTE_SEL0_SET(x) (((uint32_t)(x) << PPI_CMD_AD_CFG_BYTE_SEL0_SHIFT) & PPI_CMD_AD_CFG_BYTE_SEL0_MASK)
#define PPI_CMD_AD_CFG_BYTE_SEL0_GET(x) (((uint32_t)(x) & PPI_CMD_AD_CFG_BYTE_SEL0_MASK) >> PPI_CMD_AD_CFG_BYTE_SEL0_SHIFT)

/* Bitfield definition for register of struct array CMD: CTRL_CFG */
/*
 * IO_CFG7 (RW)
 *
 */
#define PPI_CMD_CTRL_CFG_IO_CFG7_MASK (0x10000000UL)
#define PPI_CMD_CTRL_CFG_IO_CFG7_SHIFT (28U)
#define PPI_CMD_CTRL_CFG_IO_CFG7_SET(x) (((uint32_t)(x) << PPI_CMD_CTRL_CFG_IO_CFG7_SHIFT) & PPI_CMD_CTRL_CFG_IO_CFG7_MASK)
#define PPI_CMD_CTRL_CFG_IO_CFG7_GET(x) (((uint32_t)(x) & PPI_CMD_CTRL_CFG_IO_CFG7_MASK) >> PPI_CMD_CTRL_CFG_IO_CFG7_SHIFT)

/*
 * IO_CFG6 (RW)
 *
 */
#define PPI_CMD_CTRL_CFG_IO_CFG6_MASK (0x1000000UL)
#define PPI_CMD_CTRL_CFG_IO_CFG6_SHIFT (24U)
#define PPI_CMD_CTRL_CFG_IO_CFG6_SET(x) (((uint32_t)(x) << PPI_CMD_CTRL_CFG_IO_CFG6_SHIFT) & PPI_CMD_CTRL_CFG_IO_CFG6_MASK)
#define PPI_CMD_CTRL_CFG_IO_CFG6_GET(x) (((uint32_t)(x) & PPI_CMD_CTRL_CFG_IO_CFG6_MASK) >> PPI_CMD_CTRL_CFG_IO_CFG6_SHIFT)

/*
 * IO_CFG5 (RW)
 *
 */
#define PPI_CMD_CTRL_CFG_IO_CFG5_MASK (0x100000UL)
#define PPI_CMD_CTRL_CFG_IO_CFG5_SHIFT (20U)
#define PPI_CMD_CTRL_CFG_IO_CFG5_SET(x) (((uint32_t)(x) << PPI_CMD_CTRL_CFG_IO_CFG5_SHIFT) & PPI_CMD_CTRL_CFG_IO_CFG5_MASK)
#define PPI_CMD_CTRL_CFG_IO_CFG5_GET(x) (((uint32_t)(x) & PPI_CMD_CTRL_CFG_IO_CFG5_MASK) >> PPI_CMD_CTRL_CFG_IO_CFG5_SHIFT)

/*
 * IO_CFG4 (RW)
 *
 */
#define PPI_CMD_CTRL_CFG_IO_CFG4_MASK (0x10000UL)
#define PPI_CMD_CTRL_CFG_IO_CFG4_SHIFT (16U)
#define PPI_CMD_CTRL_CFG_IO_CFG4_SET(x) (((uint32_t)(x) << PPI_CMD_CTRL_CFG_IO_CFG4_SHIFT) & PPI_CMD_CTRL_CFG_IO_CFG4_MASK)
#define PPI_CMD_CTRL_CFG_IO_CFG4_GET(x) (((uint32_t)(x) & PPI_CMD_CTRL_CFG_IO_CFG4_MASK) >> PPI_CMD_CTRL_CFG_IO_CFG4_SHIFT)

/*
 * IO_CFG3 (RW)
 *
 */
#define PPI_CMD_CTRL_CFG_IO_CFG3_MASK (0x1000U)
#define PPI_CMD_CTRL_CFG_IO_CFG3_SHIFT (12U)
#define PPI_CMD_CTRL_CFG_IO_CFG3_SET(x) (((uint32_t)(x) << PPI_CMD_CTRL_CFG_IO_CFG3_SHIFT) & PPI_CMD_CTRL_CFG_IO_CFG3_MASK)
#define PPI_CMD_CTRL_CFG_IO_CFG3_GET(x) (((uint32_t)(x) & PPI_CMD_CTRL_CFG_IO_CFG3_MASK) >> PPI_CMD_CTRL_CFG_IO_CFG3_SHIFT)

/*
 * IO_CFG2 (RW)
 *
 */
#define PPI_CMD_CTRL_CFG_IO_CFG2_MASK (0x100U)
#define PPI_CMD_CTRL_CFG_IO_CFG2_SHIFT (8U)
#define PPI_CMD_CTRL_CFG_IO_CFG2_SET(x) (((uint32_t)(x) << PPI_CMD_CTRL_CFG_IO_CFG2_SHIFT) & PPI_CMD_CTRL_CFG_IO_CFG2_MASK)
#define PPI_CMD_CTRL_CFG_IO_CFG2_GET(x) (((uint32_t)(x) & PPI_CMD_CTRL_CFG_IO_CFG2_MASK) >> PPI_CMD_CTRL_CFG_IO_CFG2_SHIFT)

/*
 * IO_CFG1 (RW)
 *
 */
#define PPI_CMD_CTRL_CFG_IO_CFG1_MASK (0x10U)
#define PPI_CMD_CTRL_CFG_IO_CFG1_SHIFT (4U)
#define PPI_CMD_CTRL_CFG_IO_CFG1_SET(x) (((uint32_t)(x) << PPI_CMD_CTRL_CFG_IO_CFG1_SHIFT) & PPI_CMD_CTRL_CFG_IO_CFG1_MASK)
#define PPI_CMD_CTRL_CFG_IO_CFG1_GET(x) (((uint32_t)(x) & PPI_CMD_CTRL_CFG_IO_CFG1_MASK) >> PPI_CMD_CTRL_CFG_IO_CFG1_SHIFT)

/*
 * IO_CFG0 (RW)
 *
 * for OUT, it defines the output value(0 or 1);
 * for IN, it defines whether to wait for ready(ready polarity is defined in ctrl_pad_pol)
 */
#define PPI_CMD_CTRL_CFG_IO_CFG0_MASK (0x1U)
#define PPI_CMD_CTRL_CFG_IO_CFG0_SHIFT (0U)
#define PPI_CMD_CTRL_CFG_IO_CFG0_SET(x) (((uint32_t)(x) << PPI_CMD_CTRL_CFG_IO_CFG0_SHIFT) & PPI_CMD_CTRL_CFG_IO_CFG0_MASK)
#define PPI_CMD_CTRL_CFG_IO_CFG0_GET(x) (((uint32_t)(x) & PPI_CMD_CTRL_CFG_IO_CFG0_MASK) >> PPI_CMD_CTRL_CFG_IO_CFG0_SHIFT)



